tome9111991/ESP32-S3_Project/ESP32-8048S043C/esp-idf-test/1.clean_template/sdkconfig.defaults
# =============================================================================
# Board: Sunton ESP32-8048S043C
# Chip:  ESP32-S3-WROOM-1  N16R8  (16 MB Flash, 8 MB Octal-PSRAM)
# =============================================================================

# --- Target -------------------------------------------------------------------
CONFIG_IDF_TARGET="esp32s3"

# --- CPU ----------------------------------------------------------------------
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

# --- Flash (16 MB, QIO, 80 MHz) -----------------------------------------------
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# --- PSRAM (8 MB Octal @ 80 MHz) ----------------------------------------------
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y

# --- FreeRTOS (1 kHz Tick - flüssiger für LVGL/Touch) -------------------------
CONFIG_FREERTOS_HZ=1000

# --- Main Task Stack (LVGL braucht mehr als 3.5 kB Default) -------------------
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# --- CPU-Cache: 64 kB I-Cache + 64 kB D-Cache, 64-Byte Lines -----------------
# Halbiert Cache-Misses gegenueber 32 kB / 32-Byte-Default.
# Kostet ~64 kB internen SRAM, ist aber bei XIP aus PSRAM ein echter Boost.
CONFIG_ESP32S3_INSTRUCTION_CACHE_64KB=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_LINE_64B=y
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y

# --- Compiler: Performance ----------------------------------------------------
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_PERF=y

# --- Log-Level (etwas ruhiger) ------------------------------------------------
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y

# --- Partition-Table (groß genug für OTA + Assets später) ---------------------
# Fürs erste Default; sobald du WebUI/LVGL-Assets brauchst, eigene CSV:
# CONFIG_PARTITION_TABLE_CUSTOM=y
# CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- USB (Native USB des S3 - praktisch für CDC-Konsole/JTAG) -----------------
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG_ENABLED=y

# --- Brownout etwas toleranter (RGB-Panel zieht Strompeaks) -------------------
CONFIG_ESP_BROWNOUT_DET_LVL_SEL_7=y
